In [58]:
import sqlite3
from datetime import datetime

In [59]:
conn = sqlite3.connect('newdb.db')
cursor = conn.cursor()

In [60]:
cursor.execute("DROP TABLE IF EXISTS Orders;")

OperationalError: database is locked

In [ ]:
# create orders table
cursor.execute("""
CREATE TABLE IF NOT EXISTS Orders (
    OrderID INTEGER PRIMARY KEY AUTOINCREMENT,
    CustomerID INTEGER,
    OrderDate TEXT,
    TotalAmount REAL
    )
    """)

In [ ]:
orders = [
    (1, "2023-01-15", 250.00),
    (2, "2023-03-22", 180.50),
    (1, "2023-07-09", 99.99),
    (3, "2023-07-20", 300.00),
    (2, "2024-01-11", 450.75),
    (3, "2024-01-25", 125.00),
    (1, "2024-04-05", 220.40),
    (2, "2024-07-18", 310.25),
    (3, "2024-07-30", 150.00),
    (1, "2024-12-10", 500.00),
    (2, "2025-01-01", 275.50),
]

cursor.executemany("""
INSERT INTO Orders (CustomerID, OrderDate, TotalAmount)
VALUES (?, ?, ?)
""", orders)

In [ ]:
conn.commit()

for row in cursor.execute("SELECT * FROM Orders"):
    print(row)

(1, 1, '2023-01-15', 250.0)
(2, 2, '2023-03-22', 180.5)
(3, 1, '2023-07-09', 99.99)
(4, 3, '2023-07-20', 300.0)
(5, 2, '2024-01-11', 450.75)
(6, 3, '2024-01-25', 125.0)
(7, 1, '2024-04-05', 220.4)
(8, 2, '2024-07-18', 310.25)
(9, 3, '2024-07-30', 150.0)
(10, 1, '2024-12-10', 500.0)
(11, 2, '2025-01-01', 275.5)

In [ ]:
query = """
SELECT *
FROM Orders
WHERE strftime('%Y', OrderDate) = '2024';
"""

In [ ]:
a = conn.execute(query)
print(a.fetchall())

[(5, 2, '2024-01-11', 450.75), (6, 3, '2024-01-25', 125.0), (7, 1, '2024-04-05', 220.4), (8, 2, '2024-07-18', 310.25), (9, 3, '2024-07-30', 150.0), (10, 1, '2024-12-10', 500.0)]

In [ ]:
print(a)

<sqlite3.Cursor object at 0x10c8689c0>

In [63]:
conn.execute("""
CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY,
    employee_name TEXT,
    birth_date TEXT,
    salary INTEGER,
    manager_id INTEGER)
    ;
""")

In [64]:
# insert some sample data
data = [
    (1, "Alice", "1990-01-01", 70000, None),
    (2, "Bob", "1985-02-02", 60000, 1),
    (3, "Charlie", "1992-03-03", 50000, 1),
    (4, "David", "1988-04-04", 75000, 2),
    (5, "Eve", "1995-05-05", 55000, 2)
]

conn.executemany("INSERT OR REPLACE INTO employees VALUES (?,?,?,?,?)", data)

In [65]:
# query without group by
import pandas as pd 

query1 = """
SELECT employee_name, birth_date
FROM employees
"""
print("Query 1 result:")
print(pd.read_sql_query(query1, conn))

Query 1 result:
  employee_name  birth_date
0         Alice  1990-01-01
1           Bob  1985-02-02
2       Charlie  1992-03-03
3         David  1988-04-04
4           Eve  1995-05-05

In [66]:
# query with group by

query2 = """
SELECT employee_name, birth_date
FROM employees
GROUP BY employee_name, birth_date"""

print("Query 2 result:\n")
pd.read_sql_query(query2, conn)

Query 2 result:

  employee_name  birth_date
0         Alice  1990-01-01
1           Bob  1985-02-02
2       Charlie  1992-03-03
3         David  1988-04-04
4           Eve  1995-05-05

In [70]:
query3 = """
SELECT birth_date, COUNT(*) as num_employees
FROM employees
GROUP BY birth_date
ORDER BY birth_date DESC
"""
print("Query 3 result:\n")
print(pd.read_sql_query(query3, conn))

Query 3 result:

   birth_date  num_employees
0  1995-05-05              1
1  1992-03-03              1
2  1990-01-01              1
3  1988-04-04              1
4  1985-02-02              1

In [75]:
# Try leaving one column out of GROUP BY (will error in SQLite)
try:
    query3 = """
    SELECT employee_name, birth_date
    FROM employees
    GROUP BY employee_name
    """
    print("Query 3 result (should fail):\n")
    print(pd.read_sql_query(query3, conn))
except Exception as e:
    print("Query 3 failed with error:", e)

Query 3 result (should fail):

  employee_name  birth_date
0         Alice  1990-01-01
1           Bob  1985-02-02
2       Charlie  1992-03-03
3         David  1988-04-04
4           Eve  1995-05-05

In [78]:
try:
    result = 5/0
except ZeroDivisionError:
    print("You can't divide by zero silly")

You can't divide by zero silly

In [81]:
try:
    x = int("hello")
except Exception as e:
    print("Something went wrong:",e)

Something went wrong: invalid literal for int() with base 10: 'hello'

In [87]:
try:
    num = float("word")
except ValueError:
    print("That is not a float/decimal")
else:
    print("Conversion worked! Decimal is:", num)
finally:
    print("Done trying")

That is not a float/decimal
Done trying

In [89]:
try:
    num = int("42")
except ValueError:
    print("That wasn't a number.")
else:
    print("Conversion worked! Number is:", num)
finally:
    print("Done trying.")

Conversion worked! Number is: 42
Done trying.

In [1]:
try:
    num = float("word")
except ValueError:
    print("that is not a float")
finally:
    print("done trying")

that is not a float
done trying

In [9]:
print("Grade calculator:")
grade = int(input("Enter total amount out of 250 points."))

if grade > 238:
    print("Grade A!")
    
elif grade <= 237 and grade >= 225:
    print("Grade A-")
    
else:
    print("You failed")

Grade calculator:
Grade A-

In [12]:
try:
    currency = float(input("Enter currency in US dollars\n"))
    country = input("Where are you traveling to: Europe, China, or Russia?\n")
    
    if country == 'China':
        print(f"The value of ${currency: .2f} USD is {currency * 7.2} Chinese Yuan")
    elif country == 'Europe':
        print(f"The value of ${currency: .2f} USD is {currency * 0.9} Euros")
    elif country == 'Russia':
        print(f"The value of ${currency: .2f} USD is {currency * 64.2} Russian rubles")
    else:
        print(f"We are not travelling to {country} at this time.")
        
except ValueError:
    print("Enter a number")

Enter a number

In [15]:
a = 100
b = 200
c = 300

d = a + b
e = c - a
print(f"{e:.1f}")

200.0

In [24]:
try:
    x = int(input("enter an integer"))

    if x <= 0:
        y = 1
    
    if x == 0:
        y = 2
    
    if x >= 0:
        y = 3
    
    else:
        y=4
    
except ValueError:
    print("Enter int")
    
print(y)

Enter int
3

In [25]:
items = 56
print(f"You have {items} items.")

You have 56 items.